docs/leets-lua/0001-Two-Sum-01.html
<!DOCTYPE html>
<html lang="en">
<head>
<!-- 2024-11-10 -->
<meta charset="utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>0001. Two Sum</title>
<meta name="author" content="d)zharii" />
<meta name="generator" content="Org Mode" />
<meta name="viewport" content="width=device-width, initial-scale=1.0">
<link rel="stylesheet" href="/static/t.css"/>
</head>
<body>
<nav><a href="/" tabindex="0">&larrhk; Back to Index</a></nav><div id="preamble" class="status">
Published 2024-11-10
</div>
<div id="content" class="content">
<header>
<h1 class="title">0001. Two Sum</h1>
<p class="subtitle" role="doc-subtitle">leetcode</p>
</header><p>
<b><b>Problem Restatement</b></b>:  
The problem is to find indices of the two numbers in an array, such that they add up to a specific target. The function should return a pair of indices of these two numbers. Assume that each input would have exactly one solution, and you may not use the same element twice. The array can contain both positive and negative integers, and indices must be returned in a 1-based format.
</p>

<p>
<b><b>Solution Description</b></b>:  
To implement the "Two Sum" function in Lua, we need to:
</p>
<ol class="org-ol">
<li>Iterate over the array while maintaining a hashmap (dictionary) that keeps track of numbers we have seen and their indices.</li>
<li>For each number `nums[i]`, calculate its complement with respect to the target (i.e., `target - nums[i]`).</li>
<li>Check if this complement is already in the hashmap.
<ul class="org-ul">
<li>If it exists, return the current index and the index stored in the hashmap as they form the required pair.</li>
<li>If not, store the current number and its index in the hashmap.</li>
</ul></li>
<li>The algorithm complexity is O(n) for time, where n is the number of elements in the array since each element is processed at most twice. The space complexity is O(n) due to the hashmap storage.</li>
</ol>

<p>
<b><b>Example</b></b>:  
Consider `nums = [2, 7, 11, 15]` and `target = 9`.  
</p>
<ul class="org-ul">
<li>Start with an empty hashmap.</li>
<li>For `i = 1`, `nums[i] = 2`: complement is `7`. Store `2` in the map.</li>
<li>For `i = 2`, `nums[i] = 7`: complement is `2`. Since `2` is in the map, return `[1, 2]`.</li>
</ul>

<p>
<b><b>References</b></b>:  
</p>
<ul class="org-ul">
<li>Lua Programming: <a href="https://www.lua.org/manual/5.3/">https://www.lua.org/manual/5.3/</a></li>
<li>Hashmaps: <a href="https://en.wikipedia.org/wiki/Hash_table">https://en.wikipedia.org/wiki/Hash_table</a></li>
</ul>

<p>
<b><b>Solution Code</b></b>:
</p>
<div class="org-src-container">
<pre class="src src-lua">-- Function to find two indices with values adding up to the target
function twoSum(nums, target)
    local map = {}
    for i = 1, #nums do
        local complement = target - nums[i]
        if map[complement] then
            return {map[complement], i}
        end
        map[nums[i]] = i
    end
    return nil -- When no solution is found
end

-- Helper function to compare two tables (arrays in Lua)
function assertEqualArrays(a, b)
    if #a ~= #b then
        error("Arrays are not equal in length")
    end
    for i = 1, #a do
        if a[i] ~= b[i] then
            error("Array elements differ at position " .. i .. ": " .. a[i] .. " ~= " .. b[i])
        end
    end
end

-- Test cases for the twoSum function
local tests = {
    {
        title = "Test 1: Simple case",
        test = function()
            local nums = {2, 7, 11, 15}
            local target = 9
            local expected = {1, 2}
            local result = twoSum(nums, target)
            assertEqualArrays(result, expected)
        end
    },
    {
        title = "Test 2: Multiple solutions",
        test = function()
            local nums = {3, 2, 4}
            local target = 6
            local expected = {2, 3}
            local result = twoSum(nums, target)
            assertEqualArrays(result, expected)
        end
    },
    {
        title = "Test 3: Same number twice",
        test = function()
            local nums = {3, 3}
            local target = 6
            local expected = {1, 2}
            local result = twoSum(nums, target)
            assertEqualArrays(result, expected)
        end
    },
    {
        title = "Test 4: Negative numbers",
        test = function()
            local nums = {-1, -2, -3, -4, -5}
            local target = -8
            local expected = {3, 5}
            local result = twoSum(nums, target)
            assertEqualArrays(result, expected)
        end
    },
    {
        title = "Test 5: No solution",
        test = function()
            local nums = {1, 2, 3}
            local target = 7
            local result = twoSum(nums, target)
            if result ~= nil then
                error("Expected nil, got a result")
            end
        end
    }
}

-- Test runner function
function runTests(tests)
    local passed = 0
    local failed = 0
    for _, testCase in ipairs(tests) do
        io.write(testCase.title .. " ... ")
        local status, err = pcall(testCase.test)
        if status then
            print("Passed")
            passed = passed + 1
        else
            print("Failed: " .. err)
            failed = failed + 1
        end
    end
    print("\nSummary:")
    print("Passed: " .. passed)
    print("Failed: " .. failed)
end

-- Execute tests
runTests(tests)
</pre>
</div>
</div>
<div id="postamble" class="status">
&copy; d)zharii. <a href="/sitemap.html">sitemap</a>
</div>
</body>
</html>
